{
  "job_url": "https://hiring.cafe/viewjob/dxxmss9dwt2gcdfx",
  "job_title": "Patient Access Rep-Imaging-SHG",
  "company": "N/A",
  "location": "Fall River, Massachusetts, United States",
  "salary": "$18-$29/hr",
  "work_mode": "Remote · Hybrid · Onsite",
  "employment_type": "Part Time",
  "posted_date": "2025-10-26 ",
  "responsibilities": "transcribe orders, schedule appointments, co-pay collection",
  "requirements": "Associates degree plus film library training; strong customer service and computer skills; EMR/hospital registration experience; 3+ years healthcare experience preferred.",
  "company_info": {
    "Year Founded": "1996",
    "Num Employees": "3580",
    "Industries": "Hospitals, Medical Organizations, Public Health Organizations, Health Care Companies",
    "Activities": "health care, hospital, rehabilitation center, hospital network, hospitals, non profit, communities, community health systems, health and medical, grantmaking organizations, diseases and disorders, health organizations, health, headquarter and parent organizations, home health agency, clinic/center, general acute care hospital, activities of insurance agents and brokers, medical centers, physical therapists, hospitals and health care, rehabilitation therapy services, physicians, mental health and substance abuse services, outpatient surgical centers, health care sector, ambulatory health care services, physicians and surgeons, physicians and surgeons, surgery-general, physicians and surgeons, public health, health and welfare clinics, medical clinics, rehabilitation services, physical therapy clinics, occupational therapists, monetary intermediation, dental practice activities, general medical practice activities, medical and dental practice activities, specialist medical practice activities, medical labs, speech-language pathologists, nutritionists, offices of physicians, offices and clinics of doctors of medicine, credit unions, federally chartered, credit unions, health care facilities and svcs, medical doctor",
    "Investors": "",
    "Headquarters Country": "United States of America",
    "Linkedin Url": "https://linkedin.com/company/southcoast-hospitals-group"
  },
  "job_description": "Job Info Company Info Job Description Southcoast Health System View All Jobs Website Non-Profit Not-for-profit health system providing care across Southeastern Massachusetts and Rhode Island. Field Value Year Founded 1996 Num Employees 3580 Industries Hospitals Medical Organizations Public Health Organizations Health Care Companies Activities health care hospital rehabilitation center hospital network hospitals non profit communities community health systems health and medical grantmaking organizations diseases and disorders health organizations health headquarter and parent organizations home health agency clinic/center general acute care hospital activities of insurance agents and brokers medical centers physical therapists hospitals and health care rehabilitation therapy services physicians mental health and substance abuse services outpatient surgical centers health care sector ambulatory health care services physicians and surgeons physicians and surgeons, surgery-general physicians and surgeons, public health health and welfare clinics medical clinics rehabilitation services physical therapy clinics occupational therapists monetary intermediation dental practice activities general medical practice activities medical and dental practice activities specialist medical practice activities medical labs speech-language pathologists nutritionists offices of physicians offices and clinics of doctors of medicine credit unions, federally chartered credit unions health care facilities and svcs medical doctor Investors Headquarters Country United States of America Linkedin Url linkedin.com/company/southcoast-hospitals-group Apply now Save Mark Applied Hide Job Report & Hide Job Description Overview: Community Focused. Care Driven. Join Southcoast Health, where your future is as promising as the care we provide. Our commitment to each other, our patients, and our community is more than a mission - it’s our way of life, and you’ll be at the heart of it. Southcoast Health is a not-for-profit, charitable, health system with multiple hospitals, clinics and facilities throughout Southeastern Massachusetts and Rhode Island. Nestled in local communities, Southcoast Health provides inclusive, ethical workplaces where our highly skilled caregivers offer world-class, comprehensive healthcare close to home. Find out for yourself why Southcoast Health has been voted ‘Best Place to Work’ for 7 years in a row! We are searching for a talented Physical Therapy Assistant *$900 new hire sign-on bonus for this position. (rehires termed more than 1 year also eligible)* Hours: 24hrs Shift:  Day/Evening shift with weekend and holiday rotation; Different Shifts  We do Work 10:30am - 7:00pm Rotation On Mon Or Tue; Willing to Rotate to different Sites Location: Breast Center - Fall River, MA A career at Southcoast Health offers you: A culture of well-being that embraces, respects, and celebrates the rich diversity of one another and the communities we serve Competitive pay and comprehensive benefits package Generous Earned Time Off Package** Employee Wellbeing Program 403B Retirement Plan with company match Tuition assistance / Federal Loan Forgiveness programs Professional growth opportunities and customized leadership training **Available to regular status employees who are scheduled to work a minimum of 24 hours. Southcoast Health is an Equal Opportunity Employer. Responsibilities:\nUnder the general supervision of the Manager/Office Coordinator or designee, perform all patient access duties to facilitate appropriate billing and optimal reimbursement to the organization in accordance with various external regulations.  Responsible for transcribing orders, scheduling appointments, advanced registration functions, co-pay collection and maintain work lists and work queues.  Perform a wide variety of reception duties including image access functions as part of the film library.\n\nQualifications: Associates Degree plus additional specialized training (film library) or equivalent knowledge and experience required. Medical Terminology Certificate desired. Excellent customer service, telephone skills and etiquette required. Strong computer skills including proficiency with medical based programs. Experience with electronic medical record, hospital patient registration systems, business office machines, and handling cash required. Prior work experience in a hospital or medical office practice setting in patient access, patient accounts or customer service preferred. Microsoft Office desired. Over three years related health care experience preferred concentrating in radiology. Must be fully vaccinated against seasonal Influenza and the COVID 19 virus or to be exempt from the requirement for medical or personal reasons by signing a statement certifying you are choosing to be exempt from vaccination once hired. Compensation: Pay rate will be determined based on level of experience. Pay Range:\nUSD $17.86 - USD $28.76 /Hr.\n\nRotation Schedule Requirement :\nWilling to Rotate to different Sites",
  "company_website": "https://www.southcoast.org/"
}